Tasks/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>Задачи</Name>
			<Addressing>InformationRegister.ИсполнителиЗадач</Addressing>
			<BasedOn>
				<xr:Item>BusinessProcess.Задание</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКИсполнению</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияВыполнения</Name>
					<Comment>не используется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаПроверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденаПроверка</Name>
					<Comment>не используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметЗадачи</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятВРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатИсполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Comment>не используется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/УведомленияОНовыхЗадачах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УведомленияОНовыхЗадачах</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УДАЛИТЬ_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Tasks/Задачи/Forms/ФормаСпискаНаРабочемСтоле/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокЗаданияОтМеня.Параметры.УстановитьЗначениеПараметра("Автор", ПараметрыСеанса.ТекущийПользователь);
	СписокВсе.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Элементы.ВсеЗадания.Видимость = (РольДоступна("АдминистраторСистемы") ИЛИ ПараметрыСеанса.ТекущийПользователь.РазрешенПросмотрВсехЗадач);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	// Зеленым цветом в списке "Задачи на меня" если задача в работе
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ПринятВРаботу");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
	//Только просмотр для номенклатуры подчиненных элементов, чтобы только характеристику можно было изменить
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокВсе.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокВсе.ЗадачаДругогоАвтораИсполнителя");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоСерый);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадание(Команда)
	ОткрытьФорму("БизнесПроцесс.Задание.Форма.ФормаБизнесПроцесса");
КонецПроцедуры

&НаСервере
Процедура ПринятьВРаботуНаСервере()
	Если не Элементы.Список.ТекущаяСтрока = Неопределено Тогда 
		Задание = Элементы.Список.ТекущаяСтрока.Ссылка.ПолучитьОбъект();
		Задание.ПринятВРаботу = Истина;
		Задание.ДатаНачалаИсполнения = ТекущаяДатаСеанса();
		Задание.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПринятьВРаботу(Команда)
	ПринятьВРаботуНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаданияОтМеняВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если БизнесПроцессаНет(ВыбраннаяСтрока) Тогда 
		СтандартнаяОбработка = Ложь;
		П = Новый Структура ("Ключ", ВыбраннаяСтрока); 
		ОткрытьФорму("Задача.Задачи.Форма.ФормаЗадачи",П,ЭтотОбъект);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция БизнесПроцессаНет(ВыбраннаяСтрока)
	Если ВыбраннаяСтрока.БизнесПроцесс.Пустая() Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// проверка просроченных задач
	ПодключитьОбработчикОжидания("ПроверкаПросроченныхЗадач", 600, Ложь); 
	
	// предупреждение о новых задачах
	ПодключитьОбработчикОжидания("ПроверитьНовыеЗадачи", 60, Ложь);

	// отбор по статусу заявки
	УстановитьОтборПоВыполненным();
	
	// отбор по галочке "Показать выполненные"
	ПоказатьВыполненные();
	
	// видимость и доступность элементов
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПросроченныхЗадач()
	КоличествоПросроченных = ПолучитьКоличествоПросроченных();
	Если КоличествоПросроченных > 0 Тогда 
		//ПоказатьПредупреждение(, "Внимание! У вас " + КоличествоПросроченных + " просроченных задач!", ,"Внимание!");
		ПараметрыНовойФормы = Новый Структура;
		ПараметрыНовойФормы.Вставить("КоличествоПросроченных", КоличествоПросроченных);
		ОткрытьФорму("Задача.Задачи.Форма.ФормаПредупреждениеОПросроченныхЗадачах",ПараметрыНовойФормы, ЭтаФорма, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоПросроченных()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачиЗадачиПоИсполнителю.Ссылка
	|ИЗ
	|	Задача.Задачи.ЗадачиПоИсполнителю КАК ЗадачиЗадачиПоИсполнителю
	|ГДЕ
	|	ЗадачиЗадачиПоИсполнителю.ПометкаУдаления = ЛОЖЬ
	|	И ЗадачиЗадачиПоИсполнителю.Выполнена = ЛОЖЬ
	|	И ЗадачиЗадачиПоИсполнителю.СрокИсполнения < &СрокИсполнения";
	
	Запрос.УстановитьПараметр("СрокИсполнения", ТекущаяДатаСеанса());
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат.Количество();
КонецФункции

&НаКлиенте
Процедура ПроверитьНовыеЗадачи()
	КоличествоНовыхЗадач = ПроверитьКоличествоНовыхЗадач();
	Ссылка = ПолучитьНавигационнуюСсылку(ПолучитьФорму("Задача.Задачи.Форма.ФормаСпискаНаРабочемСтоле"))+ "?ref=" + """" + "Открыть задачи"+ """";
	Если КоличествоНовыхЗадач > 0 Тогда 
		ПоказатьОповещениеПользователя("
		|Вам назначена задача!
		|",Ссылка,"Открыть окно задач",БиблиотекаКартинок.Информация32);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьКоличествоНовыхЗадач()
	КоличествоЗадач = 0;
	
	ЗадачиЕсть = РегистрыСведений.УведомленияОНовыхЗадачах.СоздатьНаборЗаписей();
	ЗадачиЕсть.Отбор.Исполнитель.Установить(ПараметрыСеанса.ТекущийПользователь);
	ЗадачиЕсть.Прочитать();
	КоличествоЗадач = ЗадачиЕсть.Количество();
	Если не ЗадачиЕсть.Количество()=0 Тогда 		
		Для Каждого сЗадача из ЗадачиЕсть Цикл
			ЗадачиЕсть.Удалить(сЗадача);
		КонецЦикла;
		ЗадачиЕсть.Записать();
	КонецЕсли;   	
	   	
	Возврат КоличествоЗадач;
КонецФункции

&НаКлиенте
Процедура ПоказатьВыполненные()
	
	Если ПоказыватьВыполненные Тогда
		Список.Отбор.Элементы.Очистить();
		СписокЗаданияОтМеня.Отбор.Элементы.Очистить();
		СписокВсе.Отбор.Элементы.Очистить();
	Иначе
		УстановитьОтборПоВыполненным();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоВыполненным()
		
	ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Выполнена");
	ЭО.ПравоеЗначение=Ложь;
	ЭО.Использование=Истина;
	
	ЭО=СписокЗаданияОтМеня.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Выполнена");
	ЭО.ПравоеЗначение=Ложь;
	ЭО.Использование=Истина;
	
	ЭО=СписокВсе.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Выполнена");
	ЭО.ПравоеЗначение=Ложь;
	ЭО.Использование=Истина;

	
КонецПроцедуры

&НаКлиенте
Процедура СписокВсеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если БизнесПроцессаНет(ВыбраннаяСтрока) Тогда 
		СтандартнаяОбработка = Ложь;
		П = Новый Структура ("Ключ", ВыбраннаяСтрока); 
		ОткрытьФорму("Задача.Задачи.Форма.ФормаЗадачи",П,ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИДоступностьЭлементов()
	
	Элементы.ФормаПринятьВРаботу.Доступность = (Элементы.СтраницыЗаданий.ТекущаяСтраница.Имя = "МоиЗадания");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВыполненныеПриИзменении(Элемент)
	
	ПоказатьВыполненные();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыЗаданийПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрАвторПриИзменении(Элемент)
	
	УстановитьОтборыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрИсполнительПриИзменении(Элемент)
	
	УстановитьОтборыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТочкаПродажПриИзменении(Элемент)
	
	УстановитьОтборыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборыДинамическогоСписка()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокВсе, "Автор", 	  ФильтрАвтор, 		 ВидСравненияКомпоновкиДанных.Равно,, НЕ ФильтрАвтор.Пустая());
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокВсе, "Исполнитель", ФильтрИсполнитель, ВидСравненияКомпоновкиДанных.Равно,, НЕ ФильтрИсполнитель.Пустая());
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокВсе, "ТочкаПродаж", ФильтрТочкаПродаж, ВидСравненияКомпоновкиДанных.Равно,, НЕ ФильтрТочкаПродаж.Пустая());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Задание" Тогда
		Элементы.Список.Обновить();
		Элементы.СписокВсе.Обновить();
		Элементы.СписокЗаданияОтМеня.Обновить();
	КонецЕсли;
	
КонецПроцедуры
